Revit 2027 API
WorksharingTooltipInfo.GetRequesters Method
 The ordered list of unique user names of users who have outstanding editing requests for the specified element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetRequesters()
Public Function GetRequesters As IList(Of String)
public:
IList<String^>^ GetRequesters()
member GetRequesters : unit -> IList<string>
Return Value
IList<String>
 The ordered list of unique user names.
Remarks
 The list is ordered by who placed the earliest request. If the list is empty it means that nobody is currently requesting the specified element.
See Also
Reference
WorksharingTooltipInfo Class
Autodesk.Revit.DB Namespace